<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
	<div class="row">
		<h1 class="text-center">Home</h1>
		<pre>
아르헨티나는 10일(한국시각) 미국 뉴저지 메트라이프스타디움에서 열린 캐나다와 2024년 코파아메리카 준결승에서 전반 훌리안 알바레스(맨시티),
후반 메시의 연속골에 힘입어 2대0 승리했다.

이로써 조별리그를 3전 전승으로 통과한 뒤 8강에서 에콰도르를 승부차기 끝에 어렵게 꺾고 올라온 아르헨티나는
지난 2021년 대회에 이어 두 대회 연속 결승에 진출했다.
11일에 열릴 콜롬비아와 우루과이전 승자와 14일 결승에서 격돌할 예정이다.메시가 이번 대회에서 우승할 경우
2021년 코파아메리카, 2022년 카타르월드컵에 이어 메이저 3연패 금자탑을 쌓는다.
아르헨티나는 10일(한국시각) 미국 뉴저지 메트라이프스타디움에서 열린 캐나다와 2024년 코파아메리카 준결승에서 전반 훌리안 알바레스(맨시티),
후반 메시의 연속골에 힘입어 2대0 승리했다.

이로써 조별리그를 3전 전승으로 통과한 뒤 8강에서 에콰도르를 승부차기 끝에 어렵게 꺾고 올라온 아르헨티나는
지난 2021년 대회에 이어 두 대회 연속 결승에 진출했다.
11일에 열릴 콜롬비아와 우루과이전 승자와 14일 결승에서 격돌할 예정이다.메시가 이번 대회에서 우승할 경우
2021년 코파아메리카, 2022년 카타르월드컵에 이어 메이저 3연패 금자탑을 쌓는다.
아르헨티나는 10일(한국시각) 미국 뉴저지 메트라이프스타디움에서 열린 캐나다와 2024년 코파아메리카 준결승에서 전반 훌리안 알바레스(맨시티),
후반 메시의 연속골에 힘입어 2대0 승리했다.

이로써 조별리그를 3전 전승으로 통과한 뒤 8강에서 에콰도르를 승부차기 끝에 어렵게 꺾고 올라온 아르헨티나는
지난 2021년 대회에 이어 두 대회 연속 결승에 진출했다.
11일에 열릴 콜롬비아와 우루과이전 승자와 14일 결승에서 격돌할 예정이다.메시가 이번 대회에서 우승할 경우
2021년 코파아메리카, 2022년 카타르월드컵에 이어 메이저 3연패 금자탑을 쌓는다.
아르헨티나는 10일(한국시각) 미국 뉴저지 메트라이프스타디움에서 열린 캐나다와 2024년 코파아메리카 준결승에서 전반 훌리안 알바레스(맨시티),
후반 메시의 연속골에 힘입어 2대0 승리했다.

이로써 조별리그를 3전 전승으로 통과한 뒤 8강에서 에콰도르를 승부차기 끝에 어렵게 꺾고 올라온 아르헨티나는
지난 2021년 대회에 이어 두 대회 연속 결승에 진출했다.
11일에 열릴 콜롬비아와 우루과이전 승자와 14일 결승에서 격돌할 예정이다.메시가 이번 대회에서 우승할 경우
2021년 코파아메리카, 2022년 카타르월드컵에 이어 메이저 3연패 금자탑을 쌓는다.
아르헨티나는 10일(한국시각) 미국 뉴저지 메트라이프스타디움에서 열린 캐나다와 2024년 코파아메리카 준결승에서 전반 훌리안 알바레스(맨시티),
후반 메시의 연속골에 힘입어 2대0 승리했다.

이로써 조별리그를 3전 전승으로 통과한 뒤 8강에서 에콰도르를 승부차기 끝에 어렵게 꺾고 올라온 아르헨티나는
지난 2021년 대회에 이어 두 대회 연속 결승에 진출했다.
11일에 열릴 콜롬비아와 우루과이전 승자와 14일 결승에서 격돌할 예정이다.메시가 이번 대회에서 우승할 경우
2021년 코파아메리카, 2022년 카타르월드컵에 이어 메이저 3연패 금자탑을 쌓는다.
아르헨티나는 10일(한국시각) 미국 뉴저지 메트라이프스타디움에서 열린 캐나다와 2024년 코파아메리카 준결승에서 전반 훌리안 알바레스(맨시티),
후반 메시의 연속골에 힘입어 2대0 승리했다.

이로써 조별리그를 3전 전승으로 통과한 뒤 8강에서 에콰도르를 승부차기 끝에 어렵게 꺾고 올라온 아르헨티나는
지난 2021년 대회에 이어 두 대회 연속 결승에 진출했다.
11일에 열릴 콜롬비아와 우루과이전 승자와 14일 결승에서 격돌할 예정이다.메시가 이번 대회에서 우승할 경우
2021년 코파아메리카, 2022년 카타르월드컵에 이어 메이저 3연패 금자탑을 쌓는다.
아르헨티나는 10일(한국시각) 미국 뉴저지 메트라이프스타디움에서 열린 캐나다와 2024년 코파아메리카 준결승에서 전반 훌리안 알바레스(맨시티),
후반 메시의 연속골에 힘입어 2대0 승리했다.

이로써 조별리그를 3전 전승으로 통과한 뒤 8강에서 에콰도르를 승부차기 끝에 어렵게 꺾고 올라온 아르헨티나는
지난 2021년 대회에 이어 두 대회 연속 결승에 진출했다.
11일에 열릴 콜롬비아와 우루과이전 승자와 14일 결승에서 격돌할 예정이다.메시가 이번 대회에서 우승할 경우
2021년 코파아메리카, 2022년 카타르월드컵에 이어 메이저 3연패 금자탑을 쌓는다.
아르헨티나는 10일(한국시각) 미국 뉴저지 메트라이프스타디움에서 열린 캐나다와 2024년 코파아메리카 준결승에서 전반 훌리안 알바레스(맨시티),
후반 메시의 연속골에 힘입어 2대0 승리했다.

이로써 조별리그를 3전 전승으로 통과한 뒤 8강에서 에콰도르를 승부차기 끝에 어렵게 꺾고 올라온 아르헨티나는
지난 2021년 대회에 이어 두 대회 연속 결승에 진출했다.
11일에 열릴 콜롬비아와 우루과이전 승자와 14일 결승에서 격돌할 예정이다.메시가 이번 대회에서 우승할 경우
2021년 코파아메리카, 2022년 카타르월드컵에 이어 메이저 3연패 금자탑을 쌓는다.
아르헨티나는 10일(한국시각) 미국 뉴저지 메트라이프스타디움에서 열린 캐나다와 2024년 코파아메리카 준결승에서 전반 훌리안 알바레스(맨시티),
후반 메시의 연속골에 힘입어 2대0 승리했다.

이로써 조별리그를 3전 전승으로 통과한 뒤 8강에서 에콰도르를 승부차기 끝에 어렵게 꺾고 올라온 아르헨티나는
지난 2021년 대회에 이어 두 대회 연속 결승에 진출했다.
11일에 열릴 콜롬비아와 우루과이전 승자와 14일 결승에서 격돌할 예정이다.메시가 이번 대회에서 우승할 경우
2021년 코파아메리카, 2022년 카타르월드컵에 이어 메이저 3연패 금자탑을 쌓는다.
아르헨티나는 10일(한국시각) 미국 뉴저지 메트라이프스타디움에서 열린 캐나다와 2024년 코파아메리카 준결승에서 전반 훌리안 알바레스(맨시티),
후반 메시의 연속골에 힘입어 2대0 승리했다.

이로써 조별리그를 3전 전승으로 통과한 뒤 8강에서 에콰도르를 승부차기 끝에 어렵게 꺾고 올라온 아르헨티나는
지난 2021년 대회에 이어 두 대회 연속 결승에 진출했다.
11일에 열릴 콜롬비아와 우루과이전 승자와 14일 결승에서 격돌할 예정이다.메시가 이번 대회에서 우승할 경우
2021년 코파아메리카, 2022년 카타르월드컵에 이어 메이저 3연패 금자탑을 쌓는다.
아르헨티나는 10일(한국시각) 미국 뉴저지 메트라이프스타디움에서 열린 캐나다와 2024년 코파아메리카 준결승에서 전반 훌리안 알바레스(맨시티),
후반 메시의 연속골에 힘입어 2대0 승리했다.

이로써 조별리그를 3전 전승으로 통과한 뒤 8강에서 에콰도르를 승부차기 끝에 어렵게 꺾고 올라온 아르헨티나는
지난 2021년 대회에 이어 두 대회 연속 결승에 진출했다.
11일에 열릴 콜롬비아와 우루과이전 승자와 14일 결승에서 격돌할 예정이다.메시가 이번 대회에서 우승할 경우
2021년 코파아메리카, 2022년 카타르월드컵에 이어 메이저 3연패 금자탑을 쌓는다.
아르헨티나는 10일(한국시각) 미국 뉴저지 메트라이프스타디움에서 열린 캐나다와 2024년 코파아메리카 준결승에서 전반 훌리안 알바레스(맨시티),
후반 메시의 연속골에 힘입어 2대0 승리했다.

이로써 조별리그를 3전 전승으로 통과한 뒤 8강에서 에콰도르를 승부차기 끝에 어렵게 꺾고 올라온 아르헨티나는
지난 2021년 대회에 이어 두 대회 연속 결승에 진출했다.
11일에 열릴 콜롬비아와 우루과이전 승자와 14일 결승에서 격돌할 예정이다.메시가 이번 대회에서 우승할 경우
2021년 코파아메리카, 2022년 카타르월드컵에 이어 메이저 3연패 금자탑을 쌓는다.
		</pre>
	</div>
</body>
</html>